import java.util.*;
import java.io.*;

//1000 15000
//3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9 3 2 6 3 2 6 3 2 6 9

class Main {
    
    static int N;
    static long[] card;
    
    public static void main(String[] args) throws Exception {
        // 카드수는 최대 1000개, 카드 숫자는 백만까지 나올 수 있음 -> long(카드, 결과)
        // 합체는 최대 15000번
        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
        String NM = br.readLine();
        StringTokenizer st = new StringTokenizer(NM," ");

        N = Integer.parseInt(st.nextToken());
        int M = Integer.parseInt(st.nextToken());

        String cards = br.readLine();
        st = new StringTokenizer(cards," ");
        card = new long[st.countTokens()];
        for(int i=0;i<N;i++){
            card[i] = Long.parseLong(st.nextToken());
        }

        //입력 끝

        for(int i=0;i<M;i++){
            Arrays.sort(card);
            
            long sum = card[0] + card[1];
            card[0] = sum;
            card[1] = sum;
        }

        //3. 결과
        long sum = 0;
        for(int i=0;i<N;i++){
            sum+=card[i];
        }

        System.out.println(sum);
    }

}